In [1]:
import pandas as pd

In [3]:
import numpy as np

In [5]:
df = pd.DataFrame({'sex': ['M','F', np.nan, 'M','F'],
                  'score': [5,4,3,4,np.nan]})
df

   sex  score
0    M    5.0
1    F    4.0
2  NaN    3.0
3    M    4.0
4    F    NaN

In [7]:
df['score']+1

0    6.0
1    5.0
2    4.0
3    5.0
4    NaN
Name: score, dtype: float64

In [9]:
pd.isna(df)

     sex  score
0  False  False
1  False  False
2   True  False
3  False  False
4  False   True

In [11]:
pd.isna(df).sum()

sex      1
score    1
dtype: int64

In [13]:
df.dropna(subset = ['score'])

   sex  score
0    M    5.0
1    F    4.0
2  NaN    3.0
3    M    4.0

In [15]:
df_nomiss = df.dropna(subset = ['score'])
df_nomiss['score']+1

0    6.0
1    5.0
2    4.0
3    5.0
Name: score, dtype: float64

In [17]:
df_nomiss = df.dropna(subset = ['score', 'sex'])
df_nomiss

  sex  score
0   M    5.0
1   F    4.0
3   M    4.0

In [19]:
df_nomiss2 = df.dropna() #모든 변수에 결측치 없는 데이터 추출
df_nomiss2

  sex  score
0   M    5.0
1   F    4.0
3   M    4.0

In [21]:
#평균값으로 결측치 대체하기
exam = pd.read_csv('exam.csv')

In [23]:
exam.loc[[2,7,14],['math']] = np.nan #2,7,14행의 math에 nan 할당
exam

    id  nclass  math  english  science
0    1       1  50.0       98       50
1    2       1  60.0       97       60
2    3       1   NaN       86       78
3    4       1  30.0       98       58
4    5       2  25.0       80       65
5    6       2  50.0       89       98
6    7       2  80.0       90       45
7    8       2   NaN       78       25
8    9       3  20.0       98       15
9   10       3  50.0       98       45
10  11       3  65.0       65       65
11  12       3  45.0       85       32
12  13       4  46.0       98       65
13  14       4  48.0       87       12
14  15       4   NaN       56       78
15  16       4  58.0       98       65
16  17       5  65.0       68       98
17  18       5  80.0       78       90
18  19       5  89.0       68       87
19  20       5  78.0       83       58

In [25]:
exam['math'].mean()

55.23529411764706

In [27]:
exam['math'] = exam['math'].fillna(55)
exam

    id  nclass  math  english  science
0    1       1  50.0       98       50
1    2       1  60.0       97       60
2    3       1  55.0       86       78
3    4       1  30.0       98       58
4    5       2  25.0       80       65
5    6       2  50.0       89       98
6    7       2  80.0       90       45
7    8       2  55.0       78       25
8    9       3  20.0       98       15
9   10       3  50.0       98       45
10  11       3  65.0       65       65
11  12       3  45.0       85       32
12  13       4  46.0       98       65
13  14       4  48.0       87       12
14  15       4  55.0       56       78
15  16       4  58.0       98       65
16  17       5  65.0       68       98
17  18       5  80.0       78       90
18  19       5  89.0       68       87
19  20       5  78.0       83       58

In [31]:
exam['math'].isna().sum() #결측치 빈도수

0